Repository: maramalshahrani/project10-week09-solo
Catalog: Fit Tip App/Fit Tip App/*.lproj/Localizable.strings
Languages: ar

# tip_2_desc
source: As previously noted, you are much more likely to stick with an exercise program that’s fun and rewarding. No amount of willpower is going to keep you going long-term with a workout you hate. Think outside the gym Does the thought of going to the gym fill you with dread? If you find the gym inconvenient, expensive, intimidating, or simply boring, that’s okay. There are many exercise alternatives to weight rooms and cardio equipment. For many, simply getting outside makes all the difference. You may enjoy running outdoors, where you can enjoy alone time and nature, even if you hate treadmills. Just about everyone can find a physical activity they enjoy. But you may need to think beyond the standard running, swimming, and biking options. Here are a few activities you may find fun: 1.horseback riding 2.ballroom dancing 3.rollerblading 4.hiking 5.paddle boarding 6.kayaking 7.gymnastics 8.martial arts 9.rock climbing 10.Zumba 11.Ultimate Frisbee 12.fencing Make it a game Activity-based video games such as those from Wii and Kinect can be a fun way to start moving. So-called “exergames” that are played standing up and moving around—simulating dancing, skateboarding, soccer, bowling, or tennis, for example—can burn at least as many calories as walking on a treadmill; some substantially more. Once you build up your confidence, try getting away from the TV screen and playing the real thing outside. Or use a smartphone app to keep your workouts fun and interesting—some immerse you in interactive stories to keep you motivated, such as running from hordes of zombies! Pair it with something you enjoy Think about activities that you enjoy and how you can incorporate them into an exercise routine. Watch TV as you ride a stationary bike, chat with a friend as you walk, take photographs on a scenic hike, walk the golf course instead of using a cart, or dance to music as you do household chores. Make it social Exercise can be a fun time to socialize with friends and working out with others can help keep you motivated. For those who enjoy company but dislike competition, a running club, water aerobics, or dance class may be the perfect thing. Others may find that a little healthy competition keeps the workout fun and exciting. You might seek out tennis partners, join an adult soccer league, find a regular pickup basketball game, or join a volleyball team. Try a mindfulness approach Instead of zoning out or distracting yourself when you exercise, try to pay attention to your body. By really focusing on how your body feels as you exercise—the rhythm of your breathing, the way your feet strike the ground, your muscles flexing as you move, even the way you feel on the inside—you’ll not only improve your physical condition faster but also interrupt the flow of worries or negative thoughts running through your head, easing stress and anxiety. Exercising in this way can also help your nervous system become “unstuck” and begin to move out of the immobilization stress response that characterizes PTSD and trauma. Activities that engage both your arms and legs—such as walking (especially in sand), running, swimming, weight training, rock climbing, skiing, or dancing—are great choices for practicing mindfulness.
ar: كما لوحظ سابقًا ، من المرجح أن تلتزم ببرنامج تمرين ممتع ومجزٍ. لن يساعدك أي قدر من الإرادة على الاستمرار على المدى الطويل في التمرين الذي تكرهه. فكر خارج الصالة الرياضية هل التفكير في الذهاب إلى صالة الألعاب الرياضية يشعرك بالرهبة؟ إذا وجدت الصالة الرياضية غير مريحة ، أو باهظة الثمن ، أو مخيفة ، أو مملة ، فلا بأس بذلك. هناك العديد من بدائل التمارين الرياضية لغرف الأثقال ومعدات تمارين القلب. بالنسبة للكثيرين ، مجرد الخروج من المنزل يحدث فرقًا كبيرًا. قد تستمتع بالجري في الهواء الطلق ، حيث يمكنك الاستمتاع بمفردك بالوقت والطبيعة ، حتى لو كنت تكره جهاز المشي. يمكن للجميع تقريبًا العثور على نشاط بدني يستمتعون به. ولكن قد تحتاج إلى التفكير فيما يتجاوز خيارات الجري والسباحة وركوب الدراجات القياسية. إليك بعض الأنشطة التي قد تجدها ممتعة: 1.ركوب الخيل 2. قاعة الرقص 3. لفافة 4. المشي لمسافات طويلة 5. الصعود على المجداف 6. التجديف 7. الجمباز 8. فنون الدفاع عن النفس 9- تسلق الصخور 10- زومبا 11- الفريسبي النهائي 12.المبارزة قم بإقرانها بشيء تستمتع به فكر في الأنشطة التي تستمتع بها وكيف يمكنك دمجها في روتين تمرين. شاهد التلفزيون وأنت تركب دراجة ثابتة ، أو تحدث مع صديق أثناء المشي ، أو التقط صوراً في نزهة خلابة ، أو تمشي في ملعب الجولف بدلاً من استخدام عربة ، أو ارقص على الموسيقى كما تقوم بالأعمال المنزلية. اجعلها اجتماعية يمكن أن يكون التمرين وقتًا ممتعًا للتواصل الاجتماعي مع الأصدقاء ويمكن أن يساعد التمرين مع الآخرين في الحفاظ على تحفيزك. بالنسبة لأولئك الذين يستمتعون بالرفقة ولكنهم يكرهون المنافسة ، قد يكون نادي الجري أو التمارين الرياضية المائية أو فصل الرقص هو الشيء المثالي. قد يجد البعض الآخر أن المنافسة الصحية الصغيرة تحافظ على متعة التمرين وإثارته. قد تبحث عن شركاء تنس أو الانضمام إلى دوري كرة قدم للبالغين أو العثور على لعبة كرة سلة صغيرة منتظمة أو الانضمام إلى فريق للكرة الطائرة. جرب نهج اليقظة بدلًا من تقسيم المناطق أو تشتيت انتباهك عند ممارسة الرياضة ، حاول الانتباه لجسمك. من خلال التركيز حقًا على ما يشعر به جسمك أثناء ممارسة الرياضة - إيقاع تنفسك ، والطريقة التي تضرب بها قدمك الأرض ، وعضلاتك تنثني وأنت تتحرك ، حتى الطريقة التي تشعر بها من الداخل - لن تقوم فقط بتحسين جسدي الحالة أسرع ولكن أيضًا توقف تدفق المخاوف أو الأفكار السلبية التي تمر عبر رأسك ، مما يخفف من التوتر والقلق. يمكن أن يساعد التمرين بهذه الطريقة أيضًا على أن يصبح جهازك العصبي - متوقفًا- ويبدأ في الخروج من استجابة إجهاد التثبيت التي تميز اضطراب ما بعد الصدمة والصدمة. تعتبر الأنشطة التي تشغل ذراعيك وساقيك - مثل المشي (خاصة على الرمال) أو الجري أو السباحة أو تدريب رفع الأثقال أو تسلق الصخور أو التزلج أو الرقص - خيارات رائعة لممارسة اليقظة.

# tip_3_titel
source: Stay motivated to exercise.
ar: ابق متحمسًا لممارسة الرياضة.

# tip_3_desc
source: No matter how much you enjoy an exercise routine, you may find that you eventually lose interest in it. That’s the time to shake things up and try something new or alter the way you pursue the exercises that have worked so far. Pair your workout with a treat. For example, you can listen to an audiobook or watch your favorite TV show while on the treadmill or stationary bike. Log your activity. Keep a record of your workouts and fitness progress. Writing things down or tracking them on an app increases commitment and holds you accountable to your routine. Later on, it will also be encouraging to look back at where you began. Harness the power of the community. Having others rooting for us and supporting us through exercise ups and downs helps to keep motivation strong. There are numerous online fitness communities you can join. You can also try working out with friends either in person or remotely using fitness apps that let you track and compare your progress with each other. Get inspired. Read a health and fitness magazine or visit an exercise website and get inspired with photos of people being active. Sometimes reading about and looking at images of people who are healthy and fit can motivate you to move your body.
ar: بغض النظر عن مدى استمتاعك بروتين التمرين ، فقد تجد أنك تفقد الاهتمام به في النهاية. لقد حان الوقت لتغيير الأمور وتجربة شيء جديد أو تغيير الطريقة التي تمارس بها التمارين التي نجحت حتى الآن. قم بإقران تمرينك بعلاج. على سبيل المثال ، يمكنك الاستماع إلى كتاب صوتي أو مشاهدة برنامجك التلفزيوني المفضل أثناء الركض على جهاز المشي أو الدراجة الثابتة. سجل نشاطك. احتفظ بسجل للتدريبات الخاصة بك وتقدم اللياقة البدنية. تؤدي كتابة الأشياء أو تتبعها على التطبيق إلى زيادة الالتزام وتحميلك المسؤولية تجاه روتينك. لاحقًا ، سيكون من المشجع أيضًا أن تنظر للوراء إلى حيث بدأت. تسخير قوة المجتمع. يساعد وجود الآخرين الذين يؤيدوننا ويدعموننا من خلال التمرين على الصعود والهبوط على الحفاظ على قوة الدافع. هناك العديد من مجتمعات اللياقة البدنية عبر الإنترنت التي يمكنك الانضمام إليها. يمكنك أيضًا تجربة التمرين مع الأصدقاء إما شخصيًا أو عن بُعد باستخدام تطبيقات اللياقة التي تتيح لك تتبع ومقارنة تقدمك مع بعضكما البعض. اشعل حماسك. اقرأ مجلة عن الصحة واللياقة البدنية أو قم بزيارة موقع إلكتروني للتمارين الرياضية واستلهم من صور الأشخاص الذين يمارسون نشاطًا. في بعض الأحيان ، القراءة عن صور الأشخاص الأصحاء واللياقين والنظر إليها يمكن أن يحفزك على تحريك جسمك.

source: Skip
ar: تخطي

source: Goal
ar: هدف

# chose
source: Chose your goal
ar: حدد هدفك من ممارسة الرياضة

source: Mesurments
ar: قياسات

# enter
source: Enter your body mesurments
ar: ادخل قياساتك لمتابعة الفرق والنتائج

source: Activity
ar: نشاط

# check
source: Check your calories, how many steps you walked
ar: تابع سعراتك الحرارية وعدد خطواتك

source: Meals
ar: وجبات

# variety
source: Variety of meals that align with your goals
ar: وجبات صحية متنوعة تتلاءم مع هدفك
