Repository: maramalshahrani/project10-week09-solo
Catalog: Fit Tip App/Fit Tip App/*.lproj/Localizable.strings
Languages: ar

source: Setting
ar: ضبط

# language
source: Change Language
ar: تغيير اللغة

source: Sign Out
ar: تسجيل خروج

# signoutMessage
source: Are you sure you want to sign out?
ar: هل أنت متأكد من أنك ترغب في تسجيل الخروج ؟

source: Cancel
ar: الغاء

source: Profile
ar: الملف الشخصي

source: Weight
ar: الوزن

source: Insert New Measure
ar: ادخل قياسات

source: Height
ar: الطول

source: Select your goal
ar: اختر هدفك

source: Life Style
ar: نمط حياة

source: Lose Weight
ar: خسارة وزن

source: Increase Weight
ar: زيادة وزن

source: Exercise
ar: التمارين

source: Cardio
ar: كارديو

# cardio_desc
source: 3 rounds / 30 seconds. Important notes: - Abdominal muscles taut without muting the breath. - The back is straight and the head is forward. - The feet are wide apart and the heels do not touch the ground during the exercise. - The knees do not go beyond the level of the front legs. - Inhale through the nose and exhale through the mouth regularly and calmly. - Commit to the required exercise period.
ar: 3 جولات / 30 ثانية. ملاحظات هامة: - شد عضلات البطن بدون كتم النفس. - الظهر مستقيم والرأس للأمام. - القدمان متباعدتان عن بعضهما البعض ولا يلامس الكعبان الأرض أثناء التمرين. - لا تتجاوز الركبتان مستوى الأرجل الأمامية. - الشهيق عن طريق الأنف والزفير عن طريق الفم بانتظام وبهدوء. - الالتزام بفترة التمرين المطلوبة.

source: Belly
ar: البطن

# belly_desc
source: 3 rounds / 25 times Important notes: - Hands behind the ear.. - Feet are fixed on the ground. - Lift the upper back. - Inhale through the nose when lifting. - Exhale from the mouth when descending.
ar: 3 جولات / 25 مرة ملاحظات هامة: - اليدين خلف الاذن . - الأقدام ثابتة على الأرض. - ارفع الجزء العلوي من الظهر. - الشهيق عن طريق الأنف عند الرفع. - الزفير من الفم عند النزول.

source: Arm
ar: الذراع

# arm_desc
source: 1 round / 15 times Important Notes: - The back is straight. - Touch the thigh at the start of each cycle. - Move the right hand the required number of times, forward and then backward, and then the left hand in the same way and thus counts a round. - Don't hold your breath. - Inhale through the nose and exhale through the mouth.
ar: 1 جولة / 15 مرة ملاحظات هامة: - الظهر مستقيم. - المس الفخذ في بداية كل دورة. - حرك اليد اليمنى بالعدد المطلوب من المرات ، للأمام ثم للخلف ، ثم اليد اليسرى بنفس الطريقة وبالتالي تعد جولة. - لا تحبس أنفاسك. - الشهيق عن طريق الأنف والزفير عن طريق الفم.

source: Legs
ar: الأرجل

# legs_desc
source: 1 rounds/1 minute Important Notes: - The back is straight. - Head, shoulder and back fixed to the wall. - Thighs straight and parallel. - Knees at heel level. - Hold this position for the required number of seconds. - Breathe calmly and regularly, and do not hold your breath.
ar: 1 جولة / 1 دقيقة ملاحظات هامة: - الظهر مستقيم. - تثبيت الرأس والكتف والظهر على الحائط. - أفخاذ مستقيمة ومتوازية. - الركبتين عند مستوى الكعب. - ابقى على هذا الوضع لعدد الثواني المطلوب. - تنفس بهدوء وانتظام ولا تحبس أنفاسك.

source: Back
ar: الظهر

# back_decs
source: 3 rounds / 15 times Important Notes: - Abdominal muscles tightened without holding a breath. - The back is straight. - The head is at the level of the back. - The knees are bent and do not go beyond the front of the legs. - Breathe calmly and regularly, and do not hold your breath.
ar: 3 جولات / 15 مرة ملاحظات هامة: - شد عضلات البطن بدون حبس نفس. - الظهر مستقيم. - الرأس عند مستوى الظهر. - تنثني الركبتان ولا تتعدى مقدمة الساقين. - تنفس بهدوء وانتظام ولا تحبس أنفاسك.

source: Chest
ar: الصدر

# chest_desc
source: 3 rounds / 7 times Important Notes: - Abdominal muscles, legs and buttocks tightened. - Leg, thigh and back straight unit. - Inhale through the nose when descending. - Exhale from the mouth when lifting
ar: 3 جولات / 7 مرات ملاحظات هامة: - شد عضلات البطن والساقين والأرداف. - حافظ على استقامة الساق والفخذ والظهر. - الشهيق عن طريق الأنف عند النزول. - الزفير من الفم عند الرفع.

source: Shoulder
ar: الكتف

# shoulder_desc
source: 1 round / 15 times Important Notes: - Abdominal muscles tightened without holding a breath. - The back is straight. - Hands extended for the duration of the exercise. - Move the hands in a circular motion. - Breathe calmly and regularly, and do not hold your breath.
ar: 1 جولة / 15 مرة ملاحظات هامة: - شد عضلات البطن بدون حبس نفس. - الظهر مستقيم. - تمديد اليدين طوال مدة التمرين. - حرك اليدين بشكل دائري. - تنفس بهدوء وانتظام ولا تحبس أنفاسك.

source: Whole Body
ar: الجسم

# whole_body_desc
source: 1 round/3 minutes Important Notes: - Continue the exercise for the required number of minutes. - Breathe calmly and regularly, and do not hold your breath.
ar: جولة واحدة / 3 دقائق ملاحظات هامة: - استمر في التمرين للعدد المطلوب من الدقائق. - تنفس بهدوء وانتظام ولا تحبس أنفاسك.

source: Start
ar: إبدأ

source: Finish
ar: توقف

source: Running
ar: ركض

source: Walking
ar: مشي

source: Automotive
ar: سيارة

source: Breakfast 🍳
ar: 🍳الفطور

source: Lunch 🌮
ar: 🌮 الغداء

source: Dinner 🥗
ar: 🥗العشاء

source: Egg Muffin
ar: مافن البيض

# egg_muffin_desc
source: Quantity : - 2 eggs. - Parsley 1/4 cup. - Olives 2 tbsp. - Onion 1/2 pcs. - Tomato 1/2 pcs. - A slice of low-fat cheese. Method: - Beat eggs with salt. - Chop the onions and tomatoes and add to the eggs with parsley and olive slices. - Distribute the mixture in a cupcake tray, and enter the oven for 10 or 15 minutes until the top and bottom are even. - Cheese is added to it.
ar: الكمية : - 2 بيض. - 1/4 كوب بقدونس. - زيتون 2 ملاعق كبيرة. - 1/2 حبة بصل. - 1/2 حبة طماطم. - شريحة جبن قليل الدسم. الطريقة: - يخفق البيض مع الملح. - يقطع البصل والطماطم ويضاف إلى البيض مع شرائح البقدونس والزيتون. - يوزع المزيج في صينية الكب كيك ، ويدخل الفرن لمدة 10 أو 15 دقيقة حتى يتجانس الجزءان العلوي والسفلي. - يضاف إليها الجبن.

# poached
source: Poached eggs with tomatoes
ar: بيض مسلوق مع طماطم

# poached_desc
source: Quantity : - 2 eggs. - Whole wheat bread. - Tomato sauce 1 tbsp. - Green onion 1 piece. - Tomato 1 piece. - Olive oil. Method: - Boil eggs until they are level. - Mix onions with tomatoes, tomato sauce, spices and olive oil. - Put the peeled boiled eggs on the tomato sauce and leave on the fire for two minutes. - Served with bread.
ar: الكمية : - 2 بيض. - خبز أسمر. - صلصة طماطم 1 ملعقة كبيرة. - حبة بصل أخضر. - حبة طماطم. - زيت الزيتون. الطريقة: - اسلقي البيض حتى يستوي. - يخلط البصل مع الطماطم وصلصة الطماطم والبهارات وزيت الزيتون. - يوضع البيض المسلوق المقشر على صلصة الطماطم ونتركه على النار لمدة دقيقتين. - يقدم مع الخبز.

source: Frittata
ar: فريتاتا

# frittata_desc
source: Quantity : - Kale (European lettuce) 1/2 cup. - 1/2 piece of cold pepper. - Low-fat feta cheese 2 tbsp. - 2 eggs. Method: - Stir the kale on the fire with a pinch of olive oil spray, salt and pepper until it wilts. - Add eggs, pepper and cheese and leave on low heat until cooked. - Put the dish in the oven until browned from the top.
ar: الكمية: - كالي (خس أوروبي) 1/2 كوب. - 1/2 قطعة فلفل بارد. - جبنة فيتا قليلة الدسم 2 ملعقة كبيرة. - 2 بيض. الطريقة: - حركي الكالي على النار مع رشة زيت زيتون وملح وفلفل حتى يذبل. - نضيف البيض والفلفل والجبن ونتركها على نار هادئة حتى تنضج. - نضع الطبق في الفرن حتى يحمر من الأعلى.

# potato
source: Potato boats
ar: قوارب البطاطس

# potato_desc
source: Quantity : - Minced meat 2 tbsp. - olive oil 1 tbsp. - Sweet potato 1 piece. - Hot red pepper 1/2 pcs. - Light mozzarella cheese 2 tbsp. - Chopped onion 2 tbsp. - Tomato sauce 1 tbsp. Method: - Cut sweet potatoes in half and boil. - It is engraved from the text and left aside. - Filling: kosha with onions and favorite spices with olive oil. - Add meat, tomato sauce and sweet pepper and stir them over the fire. - Distribute the filling on the potatoes and add mozzarella cheese. - Put in the oven until browned on top.
ar: الكمية : - لحم مفروم 2 ملاعق كبيرة. - زيت زيتون 1 ملعقة كبيرة. - بطاطا حلوة قطعة واحدة. - 1/2 حبة فلفل أحمر حار. - جبن موزاريلا قليل الدسم 2 ملاعق كبيرة. - بصل مقطع 2 ملاعق كبيرة. - صلصة طماطم 1 ملعقة كبيرة. الطريقة: - تقطع البطاطا الحلوة إلى نصفين وتسلق. - تحفر من النص وتترك جانباً. - الحشوة: كشنة البصل والبهارات المفضلة بزيت الزيتون. - نضيف اللحم وصلصة الطماطم والفلفل الحلو ونقلبهم على النار. - توزع الحشوة على البطاطس وأضيفي جبنة الموزاريلا. - توضع في الفرن حتى يحمر من الأعلى.

# chicken
source: Chicken Teriyaki
ar: تريكي الدجاج

# chicken_desc
source: Quantity : - 1/2 red onion - Carrots 1 piece. - 1/2 piece of cold pepper. - 1/2 piece hot pepper. - Salt, black pepper and garlic powder 1 tsp. - Minced ginger 1 tsp. - Garlic 1 piece. - Chicken breast 1 piece. - 1/2 cup boiled rice. - Soy sauce 2 tablespoons. - 1 green onion. - Sesame 1 tbsp. - Starch 1 tbsp. Method: - Fry the chicken in a hot frying pan using olive oil spray with the addition of spices and salt . - Cut vegetables into slices: onions - carrots - cold pepper. - After the chicken is done, add the vegetables with hot pepper, garlic and ginger with a little water, cover the pot and leave it on a low heat until it is done. - Remove the soy sauce and starch with about a quarter cup of water and add it to the chicken and vegetables. - Garnish the dish with green pepper and sesame. - Served with boiled rice.
ar: الكمية : - 1/2 بصلة حمراء - جزر 1 حبة. - 1/2 قطعة فلفل بارد. - 1/2 قطعة فلفل حار. - 1 ملعقة صغيرة ملح وفلفل أسود ومسحوق ثوم. - زنجبيل مفروم 1 ملعقة صغيرة. - ثوم قطعة واحدة. - صدر دجاج 1 قطعة. - 1/2 كوب أرز مسلوق. - 2 ملاعق كبيرة صلصة الصويا. - 1 بصلة خضراء. - سمسم 1 ملعقة كبيرة. - نشاء 1 ملعقة كبيرة. الطريقة: - يقلى الدجاج فى مقلاة ساخنة ببخاخ زيت الزيتون مع إضافة البهارات والملح. - تقطع الخضار إلى شرائح: بصل - جزر - فلفل بارد. - بعد أن ينضج الدجاج نضيف الخضار مع الفلفل الحار والثوم والزنجبيل مع قليل من الماء ، ونغطي القدر ونتركه على نار هادئة حتى ينضج. - نمزج صلصة الصويا والنشا بحوالي ربع كوب ماء ونضيفها إلى الدجاج والخضروات. - يُزين الطبق بالفلفل الأخضر والسمسم. - يقدم مع أرز مسلوق.

# chicken_vegetables
source: Chicken tray with vegetables
ar: صينية دجاج بالخضروات

# chicken_vegetables_desc
source: Quantity : - Sweet potato 1 piece. - Carrots 1 piece. - Coriander sticks 1/4 cup. - Zucchini 1 piece. - Chicken. Method: - Cut the chicken and vegetables into large cubes and season with olive oil, spices, salt and black pepper. - Put the ingredients in a tray, pour about a quarter cup of water over it, and cover the tray with aluminum foil. - Put the tray in the oven until it's level, and remove the aluminum foil until it turns red from the top. - Served with bread.
ar: الكمية : - بطاطا حلوة قطعة واحدة. - جزر 1 حبة. - 1/4 كوب كزبرة. - كوسة قطعة واحدة. - دجاج. الطريقة: - نقطع الدجاج والخضروات إلى مكعبات كبيرة وتتبل بزيت الزيتون والبهارات والملح والفلفل الأسود. - ضعي المكونات في صينية ، واسكبي حوالي ربع كوب من الماء عليها ، وغطي الصينية بورق الألمنيوم. - ضعي الصينية في الفرن حتى تستوي ، ثم قومي بإزالة ورق الألمنيوم حتى يتحمر من الأعلى. - يقدم مع الخبز.

# salmon
source: Salmon Steak
ar: شريحة سلمون

# salmon_desc
source: Quantity : - Parsley 1 tbsp. - 1/4 cup boiled rice. - Honey 1/2 tbsp. - Salmon. - Lemon 1 piece. - Garlic mashed 1 piece. - Chili powder 1 tsp. - Salt and black pepper 1 tsp. Method: - Mix honey, lemon juice, mashed garlic, black pepper, salt and chili powder. - Marinate the fish and leave it in the refrigerator for an hour. - It is preferable to use a non-stick frying pan and spray with olive oil, then put the salmon steak and cover it. - After the first side is flat, flip it over. - Served with boiled rice.
ar: الكمية : - بقدونس 1 ملعقة كبيرة. - 1/4 كوب أرز مسلوق. - نصف ملعقة كبيرة عسل. - سمك السالمون. - حبة ليمون. - مهروس الثوم 1 قطعة. - مسحوق الفلفل الحار 1 ملعقة صغيرة. - ملح وفلفل أسود 1 ملعقة صغيرة. الطريقة: - مزيج العسل وعصير الليمون والثوم المهروس والفلفل الأسود والملح ومسحوق الفلفل الحار. - انقع السمك واتركه في الثلاجة لمدة ساعة. - يفضل استخدام مقلاة ضد الالتصاق مع رش زيت الزيتون ثم وضع شرائح السلمون وتغطيتها. - بعد أن يصبح الجانب الأول مستويا ، اقلبه. - يقدم مع أرز مسلوق.

# oat
source: Oat Soup
ar: شوربة الشوفان

# oat_desc
source: Quantity : - 1/2 onion slices. - Tomato juice 1 tablet. - Tomato sauce 1 tsp. - Salt, black pepper, mixed spices, black lemon 1 tbsp. - oats. Method: - Mix onions with spices and spray with olive oil spray. - Add the rest of the ingredients to the onion and tomato mixture. - Add 1 cup of water or according to the oats. - Leave on low heat for 20-30 minutes.
ar: الكمية: - 1/2 بصل شرائح. - عصير طماطم 1 قرص. - صلصة الطماطم 1 ملعقة صغيرة. - ملح ، فلفل أسود ، بهارات مشكلة ، ليمون أسود 1 ملعقة كبيرة. - الشوفان. الطريقة: - يخلط البصل مع البهارات ويرش بزيت الزيتون. - يضاف باقي المكونات الى خليط البصل والطماطم. - يضاف 1 كوب ماء أو حسب الشوفان. - اتركيه على نار خفيفة لمدة 20-30 دقيقة.

# avocado
source: Avocado Pasta
ar: باستا الأفوكادو

# avocado_desc
source: Quantity : - Garlic clove 1 piece. - Spinach 1 cup. - Lemon juice 1 tablespoon. - Chicken breast 1 piece. - Avocado 1/2 pcs. - Parmesan cheese 2 tablespoons. - Whole wheat pasta 1/2 cup. Method: - Climb the pasta. - Chop the onions and fry and add the chicken. - Add garlic, spices, salt, black pepper and oregano. - In a food processor, put spinach, avocado, garlic and lemon juice. - Add the mixture to the chicken and stir for 5 minutes on the stove. - Add pasta to them, cover and simmer over low heat for 10 minutes. - After it is done, sprinkle cheese on it and serve.
ar: الكمية : - فص ثوم 1 حبة. - 1 كوب سبانخ. - عصير ليمون 1 ملعقة كبيرة. - صدر دجاج 1 قطعة. - نصف حبة أفوكادو. - 2 ملاعق كبيرة جبن بارميزان. - 1/2 كوب مكرونة من القمح الكامل. الطريقة: - تسلق المعكرونة. - يقطع البصل ويقلى ويضاف الدجاج. - يضاف الثوم والبهارات والملح والفلفل الأسود والأوريغانو. - في محضر الطعام ، ضعي السبانخ والأفوكادو والثوم وعصير الليمون. - نضيف الخليط إلى الدجاج ويقلب لمدة 5 دقائق على الموقد. - أضيفي المعكرونة إليها ، غطيها واتركيها على نار خفيفة لمدة 10 دقائق. - بعد أن تنضج يرش عليها الجبن وتقدم.

source: Tips
ar: نصائح

# tip_1_titel
source: How to Start Exercising and Stick to It
ar: كيف تبدأ في ممارسة الرياضة والتمسك بها

# tip_1_desc
source: If you’re having trouble beginning an exercise plan or following through, you’re not alone. Many of us struggle getting out of the sedentary rut, despite our best intentions. You already know there are many great reasons to exercise—from improving energy, mood, sleep, and health to reducing anxiety, stress, and depression. And detailed exercise instructions and workout plans are just a click away. But if knowing how and why to exercise was enough, we’d all be in shape. Making exercise a habit takes more—you need the right mindset and a smart approach. While practical concerns like a busy schedule or poor health can make exercise more challenging, for most of us, the biggest barriers are mental. Maybe it’s a lack of self-confidence that keeps you from taking positive steps, or your motivation quickly flames out, or you get easily discouraged and give up. We’ve all been there at some point. Whatever your age or fitness level—even if you’ve never exercised a day in your life —there are steps you can take to make exercise less intimidating and painful and more fun and instinctive. Ditch the all-or-nothing attitude. You don’t have to spend hours in a gym or force yourself into monotonous or painful activities you hate to experience the physical and emotional benefits of exercise. A little exercise is better than nothing. In fact, adding just modest amounts of physical activity to your weekly routine can have a profound effect on your mental and emotional health. Be kind to yourself. Research shows that self-compassion increases the likelihood that you’ll succeed in any given endeavor. So, don’t beat yourself up about your body, your current fitness level, or your supposed lack of willpower. All that will do is demotivate you. Instead, look at your past mistakes and unhealthy choices as opportunities to learn and grow. Check your expectations. You didn’t get out of shape overnight, and you’re not going to instantly transform your body either. Expecting too much, too soon only leads to frustration. Try not to be discouraged by what you can’t accomplish or how far you have to go to reach your fitness goals. Instead of obsessing over results, focus on consistency. While the improvements in mood and energy levels may happen quickly, the physical payoff will come in time.
ar: إذا كنت تواجه مشكلة في بدء خطة التمرين أو المتابعة ، فأنت لست وحدك. يكافح الكثير منا للخروج من الروتين المستقر ، على الرغم من نوايانا الحسنة. أنت تعلم بالفعل أن هناك العديد من الأسباب الرائعة لممارسة الرياضة - من تحسين الطاقة والمزاج والنوم والصحة إلى تقليل القلق والتوتر والاكتئاب. وتعليمات التمرين التفصيلية وخطط التمرين ليست سوى نقرة واحدة. ولكن إذا كانت معرفة كيف ولماذا ممارسة الرياضة كافية ، فسنكون جميعًا في حالة جيدة. إن جعل التمرين عادة يتطلب المزيد - فأنت بحاجة إلى العقلية الصحيحة والنهج الذكي. في حين أن الاهتمامات العملية مثل الجدول الزمني المزدحم أو الصحة السيئة يمكن أن تجعل التمرين أكثر صعوبة ، بالنسبة لمعظمنا ، فإن أكبر الحواجز هي عقلية. ربما يكون الافتقار إلى الثقة بالنفس هو الذي يمنعك من اتخاذ خطوات إيجابية ، أو أن دوافعك تشتعل بسرعة ، أو تشعر بالإحباط والاستسلام بسهولة. لقد كنا جميعًا هناك في مرحلة ما. مهما كان عمرك أو مستوى لياقتك - حتى لو لم تمارس يومًا واحدًا في حياتك - فهناك خطوات يمكنك اتخاذها لتقليل ترهيب التمارين وإيلامها وجعلها أكثر متعة وغريزية. تخلص من موقف الكل أو لا شيء. لا يتعين عليك قضاء ساعات في صالة الألعاب الرياضية أو إجبار نفسك على القيام بأنشطة رتيبة أو مؤلمة تكرهها لتجربة الفوائد الجسدية والعاطفية للتمرين. القليل من التمرين أفضل من لا شيء. في الواقع ، يمكن أن يكون لإضافة كميات متواضعة من النشاط البدني إلى روتينك الأسبوعي تأثير عميق على صحتك العقلية والعاطفية. كن لطيف مع نفسك. تظهر الأبحاث أن التعاطف مع الذات يزيد من احتمالية نجاحك في أي مسعى معين. لذلك ، لا تضغط على نفسك بشأن جسمك ، أو مستوى لياقتك الحالي ، أو افتقارك المفترض إلى قوة الإرادة. كل ما سيفعله هو تثبيط هويتك. بدلاً من ذلك ، انظر إلى أخطائك السابقة وخياراتك غير الصحية كفرص للتعلم والنمو. تحقق من توقعاتك. لم تفقد لياقتك بين عشية وضحاها ، ولن تقوم بتحويل جسمك على الفور أيضًا. إن توقع الكثير في وقت مبكر جدًا لا يؤدي إلا إلى الإحباط. حاول ألا تثبط عزيمتك بسبب ما لا يمكنك تحقيقه أو المدى الذي يجب أن تقطعه للوصول إلى أهداف لياقتك. بدلاً من الاستحواذ على النتائج ، ركز على الاتساق. في حين أن التحسينات في المزاج ومستويات الطاقة قد تحدث بسرعة ، فإن المردود المادي سيأتي في الوقت المناسب.

# tip_2_titel
source: Making exercise more enjoyable.
ar: أجعل التمرين أكثر متعة.
